Test project/blog/app/controllers/users_controller.rb

  def show
    @user = User.find(params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def create
	@user = User.new(user_params)
	if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "admin", "banned") VALUES (?, ?, ?, ?, ?, ?)  [["username", "Admin"], ["email", "admail@null.net"], ["created_at", 2016-12-05 06:43:48 UTC], ["updated_at", 2016-12-05 06:43:48 UTC], ["admin", true], ["banned", false]]